TerpDAC/MicrophoneControllerCode/ESP8266_AS_ARDUINO_PROTOTYPE_FTEST/config.cpp
  if (SPIFFS.exists(fn)) {
    // WORKAROUND: SPIFFS goes bonkers when overwriting file.
    // Delete it first!
    SerialPrintStr("[spiffsWrite] File already exists, deleting to start anew: ");
    Serial.println(fn);
    SPIFFS.remove(fn);
  }
  
  File f = SPIFFS.open(fn, "w");
  
  if (!f) {
      SerialPrintStr("[spiffsWrite] ERROR: File open failed for file: ");
      Serial.println(fn);
      return;
  }

  SerialPrintStr("[spiffsWrite] Successfully opened file: ");
  Serial.println(fn);
  DUMP_STACK_STATS();

  SerialPrintStr("[spiffsWrite] CRC32 computed: ");
  Serial.println(crc32_chksum, HEX);
  
  /* Write CRC32 bytes */
  SerialPrintStrLn("[spiffsWrite] Writing CRC32...");
  f.write((uint8_t *)&crc32_chksum, 4);

  SerialPrintStr("[spiffsWrite] File position is now at: ");
  Serial.println(f.position());

  /* Write actual data bytes */
  SerialPrintStrLn("[spiffsWrite] Writing data...");
  f.write(data, size);

  SerialPrintStr("[spiffsWrite] File position is now at: ");
  Serial.println(f.position());

  /* Close file */
  SerialPrintStrLn("[spiffsWrite] Closing file...");
  f.close();

  SerialPrintStrLn("[spiffsWrite] Returning...");
  interrupts();
}

/**
 * Read file from the SPIFFS.
 * 
 * Read data from the SPIFFS. This function will read the entire data file
 * specified (including the CRC32). Once read, the data will be verified with
 * the first 4 bytes of the data chunk, aka the CRC32 checksum computed when
 * the data was written.
 * 
 * If the data is verified, the data will be written to the pointer provided.
 * If the checksum verification fails, the pointer will instead be written with
 * zeroes. If the file does not exist, the pointer will also be written with
 * zeroes.
 * 
 * @param [in]  fn      filename of the file to read from
 * @param [out] data    data to read out from the EEPROM; should contain enough
 *                      memory to store the amount of data specified in the size
 *                      argument
 * @param [in]  size    size of the data that will be read from the EEPROM;
 *                      does NOT include the CRC32
 * @see spiffsWrite()
 */
void spiffsRead(const char *fn, uint8_t *data, size_t size) {
  uint32_t crc32_chksum_ref = 0, crc32_chksum_computed = 0;

  noInterrupts();
  
  File f = SPIFFS.open(fn, "r");
  
  if (!f) {
      SerialPrintStr("[spiffsRead] ERROR: File open failed for file: ");
      Serial.println(fn);
      memset(data, 0, size);
      interrupts();
      return;
  }

  if (f.size() == 0) {
    SerialPrintStr("[spiffsRead] WARNING: File open detected emptiness for file: ");
      Serial.println(fn);
      memset(data, 0, size);
      interrupts();
      return;
  }
  
  /* First, read the CRC32 checksum. */
  f.read((uint8_t *)&crc32_chksum_ref, 4);

  SerialPrintStr("[spiffsRead] File position is now at: ");
  Serial.println(f.position());

  /* Then, read the rest of the file... */
  f.read((uint8_t *)data, size);

  SerialPrintStr("[spiffsRead] File position is now at: ");
  Serial.println(f.position());

  /* Verify checksum */
  crc32_chksum_computed = crc32(data, size);
  
  if (crc32_chksum_computed != crc32_chksum_ref) {
    /* Zero out memory */
    SerialPrintStr("[spiffsRead] CRC32 match failed for file ");
    Serial.print(fn);
    SerialPrintStr(" - computed CRC32 ");
    Serial.print(crc32_chksum_computed, HEX);
    SerialPrintStr(" does not match reference (stored) CRC32 ");
    Serial.println(crc32_chksum_ref, HEX);
    
    memset(data, 0, size);
  }

  interrupts();
}

/**
 * Initialize the EEPROM.
 * 
 * Enable internal EEPROM reading and writing. This should only be
 * called once.
 */
void eepromInit() {
  // WARNING:
  //   This table is now deprecated. The calculations for each variable's offset
  //   and size are automatically determined via macros. This table will be
  //   condensed down into field name, field components, and field component sizes
  //   only in a future commit.
  // 
  // EEPROM usage:
  //   mid_thresh (int)
  //     offset 0 bytes
  //       - 4 bytes CRC32
  //       - 4 bytes int
  //     Total = 8 bytes
  //   high_thresh (int)
  //     offset 8 bytes
  //       - 4 bytes CRC32
  //       - 4 bytes int
  //     Total = 8 bytes
  //   ssid (str)
  //     offset 16 bytes
  //       - 4 bytes CRC32
  //       - 32 bytes ASCII
  //     Total = 36 bytes
  //     due to 8 byte chunking, will technically take up 40 bytes
  //   psk (str)
  //     offset 56 bytes
  //       - 4 bytes CRC32
  //       - 64 bytes ASCII
  //     Total = 68 bytes
  //     due to 8 byte chunking, will technically take up 72 bytes
  //   micsense_server (str)
  //     offset 128 bytes
  //       - 4 bytes CRC32
  //       - 64 bytes ASCII
  //     Total = 68 bytes
  //     due to 8 byte chunking, will technically take up 72 bytes
  //   use_https (str)
  //     offset 200 bytes
  //       - 4 bytes CRC32
  //       - 1 byte char "bool" (true/false, FF/00)
  //     Total = 5 bytes
  //   https_fingerprint (str)
  //     offset 208 bytes
  //       - 4 bytes CRC32
  //       - 128 bytes ASCII
  //     Total = 132 bytes
  //     NOTE:
  //       For the fingerprint, the currently accepted one (as of writing) is
  //       a SHA1 fingerprint, which is very small (40-59 bytes, with or without
  //       spacing, respectively). However, it is strongly recommended to upgrade
  //       the hashing algorithm to something stronger, such as SHA256, SHA512, or
  //       the newly created SHA3. The space allocated can support SHA512/SHA3
  //       with no spaces (128 bytes).
  //       
  //       When support is enabled for better hashing, this field is futureproof...
  //       at least until the newer hashes are broken, too!
  //
  // Overall usage: 344 bytes
  // 
  // Future security improvements can include HTTPS certificates, but
  // implementation has not stabilized yet, and the certificates may
  // need to be stored as SPIFFS instead of EEPROM due to size
  // constraints. Therefore, there is no space allocated here.

  EEPROM.begin(768);
}

/**
 * Checksum and write data to the EEPROM.
 * 
 * Write data to the EEPROM. This function will compute the CRC32 of
 * the given data, and write it as the first 4 bytes after the given
 * offset. Once done, the data will be written right after the
 * checksum.
 * 
 * @param [in] offset  offset of the EEPROM to write to
 * @param [in] data    data to write to the EEPROM
 * @param [in] size    size of the data that will be written to the EEPROM;
 *                     does NOT include the CRC32
 * @see eepromRead()
 */
void eepromWrite(const int offset, const void *data, size_t size) {
  size_t pos = 0;
  uint32_t crc32_chksum = crc32(data, size);

  noInterrupts();

  SerialPrintStr("[eepromWrite] Writing EEPROM offset ");
  Serial.print(offset);
  SerialPrintStr(", size ");
  Serial.println(size);
  
  /* Write CRC32 bytes */
  EEPROM.write(offset, GET_RAW_BYTE(&crc32_chksum, 0));
  EEPROM.write(offset + 1, GET_RAW_BYTE(&crc32_chksum, 1));
  EEPROM.write(offset + 2, GET_RAW_BYTE(&crc32_chksum, 2));
  EEPROM.write(offset + 3, GET_RAW_BYTE(&crc32_chksum, 3));

