TerpDAC/MicrophoneControllerCode/ESP8266_AS_ARDUINO_PROTOTYPE_FTEST/config.cpp
  SerialPrintStr("[eepromWrite] CRC32 computed: ");
  Serial.println(crc32_chksum, HEX);

  /* Write actual data bytes */
  for (pos = 0; pos < size; pos++) {
    EEPROM.write(offset + 4 + pos, GET_RAW_BYTE(data, pos));
    SerialPrintStr("[eepromWrite] Byte ");
    Serial.print(pos);
    SerialPrintStr(" returns ");
    Serial.println(GET_RAW_BYTE(data, pos), HEX);

    if (EEPROM.read(offset + 4 + pos) != GET_RAW_BYTE(data, pos)) {
      SerialPrintStr("[eepromWrite] Mismatched byte @ ");
      Serial.print(pos);
      SerialPrintStr(" | Correct byte is ");
      Serial.print(GET_RAW_BYTE(data, pos), HEX);
      SerialPrintStr(" | EEPROM byte is ");
      Serial.println(EEPROM.read(offset + 4 + pos), HEX);
    }
  }

  interrupts();
}

/**
 * Read and verify data from the EEPROM.
 * 
 * Read data from the EEPROM. This function will read the entire data chunk
 * specified (including the CRC32). Once read, the data will be verified with
 * the first 4 bytes of the data chunk, aka the CRC32 checksum computed when
 * the data was written.
 * 
 * If the data is verified, the data will be written to the pointer provided.
 * If the checksum verification fails, the pointer will instead be written with
 * zeroes.
 * 
 * @param [in]  offset  offset of the EEPROM to read from
 * @param [out] data    data to read out from the EEPROM; should contain enough
 *                      memory to store the amount of data specified in the size
 *                      argument
 * @param [in]  size    size of the data that will be read from the EEPROM;
 *                      does NOT include the CRC32
 * @see eepromRead()
 */
void eepromRead(const int offset, void *data, size_t size) {
  size_t pos = 0;
  uint32_t crc32_chksum_ref = 0, crc32_chksum_computed = 0;

  noInterrupts();
  
  SerialPrintStr("[eepromRead] Reading EEPROM offset ");
  Serial.print(offset);
  SerialPrintStr(", size ");
  Serial.println(size);
  
  /* Write CRC32 bytes */
  SET_RAW_BYTE(&crc32_chksum_ref, 0, EEPROM.read(offset));
  SET_RAW_BYTE(&crc32_chksum_ref, 1, EEPROM.read(offset + 1));
  SET_RAW_BYTE(&crc32_chksum_ref, 2, EEPROM.read(offset + 2));
  SET_RAW_BYTE(&crc32_chksum_ref, 3, EEPROM.read(offset + 3));

  /* Read data bytes */
  for (pos = 0; pos < size; pos++) {
    SET_RAW_BYTE(data, pos, EEPROM.read(offset + 4 + pos));
    SerialPrintStr("[eepromRead] Byte ");
    Serial.print(pos);
    SerialPrintStr(" returns ");
    Serial.println(EEPROM.read(offset + 4 + pos), HEX);
  }

  /* Verify checksum */
  crc32_chksum_computed = crc32(data, size);
  
  if (crc32_chksum_computed != crc32_chksum_ref) {
    /* Zero out memory */
    SerialPrintStr("[eepromRead] CRC32 match failed - computed CRC32 ");
    Serial.print(crc32_chksum_computed, HEX);
    SerialPrintStr(" does not match reference (stored) CRC32 ");
    Serial.println(crc32_chksum_ref, HEX);

    memset(data, 0, size);
  }

  interrupts();
}

/* Scrambling functions */
uint8_t reverse(uint8_t b) {
   b = (b & 0xF0) >> 4 | (b & 0x0F) << 4;
   b = (b & 0xCC) >> 2 | (b & 0x33) << 2;
   b = (b & 0xAA) >> 1 | (b & 0x55) << 1;
   return b;
}

/**
 * Scramble bytes with a basic method.
 * 
 * Given the input bytes, perform a simple scramble on them. Note that once
 * scrambled, there is no way to reverse the bytes. (Reversing can be done
 * manually, but there is no function provided to do so. This is meant to be
 * a one-way transformation function.)
 * 
 * Operations performed, in order:
 *   For each byte, flip its bits.
 *   Reverse byte order and perform add/subtract transform:
 *     Lower side = upper side + 3
 *     Upper side = lower side - 3
 * 
 * @param [in] bytes   bytes to scramble
 * @param [in] size    size of the bytes to scramble
 * @see scrambleBytesAdv()
 */
void scrambleBytesBasic(uint8_t *bytes, size_t size) {
  size_t i;
  uint8_t b;
  
  SerialPrintStrLn("[scrambleBytesBasic] Doing basic byte scrambling...");
  SerialPrintStr("[scrambleBytesBasic] First 3 bytes: ");
  Serial.print(bytes[0], HEX);
  Serial.print(bytes[1], HEX);
  Serial.println(bytes[2], HEX);
  
  for (i = 0; i < size; i++) {
    //ESP.wdtFeed();
    b = bytes[i];
    b = (b & 0xF0) >> 4 | (b & 0x0F) << 4;
    b = (b & 0xCC) >> 2 | (b & 0x33) << 2;
    b = (b & 0xAA) >> 1 | (b & 0x55) << 1;
    b += 1;
    bytes[i] = b;
  }

  /* Reverse bytes */
  for (i = 0; i < size / 2; i++) {
    b = bytes[i];
    bytes[i] = bytes[size - i - 1] + 3;
    bytes[size - i - 1] = b - 3;
  }

  SerialPrintStr("[scrambleBytesBasic] Post scramble, first 3 bytes: ");
  Serial.print(bytes[0], HEX);
  Serial.print(bytes[1], HEX);
  Serial.println(bytes[2], HEX);
  
  DUMP_STACK_STATS();
}

/**
 * Scramble bytes with a more advanced method.
 * 
 * Given the input bytes, perform a more complicated scramble on them.
 * Note that once scrambled, there is no way to reverse the bytes. (Reversing
 * can be done manually, but there is no function provided to do so. This is
 * meant to be a one-way transformation function.)
 * 
 * Operations performed, in order:
 *   Perform basic scramble.
 *   Read salt from SPIFFS.
 *     If salt doesn't exist, generate one and save it.
 *   Scramble salt.
 *   Append MAC to salt.
 *   Mix MAC into salt (starting from idx 0, even byte swaps).
 *   XOR bytes with salt.
 *   Invert each byte.
 * 
 * @param [in] bytes   bytes to scramble
 * @param [in] size    size of the bytes to scramble
 * @see scrambleBytesBasic()
 */
void scrambleBytesAdv(uint8_t *bytes, size_t size) {
  uint8_t salt[SALT_SIZE + 6];
  uint8_t tmp;
  size_t i;

  SerialPrintStrLn("[scrambleBytesAdv] Doing advanced byte scrambling...");
  SerialPrintStr("[scrambleBytesAdv] First 3 bytes: ");
  Serial.print(bytes[0], HEX);
  Serial.print(bytes[1], HEX);
  Serial.println(bytes[2], HEX);
  
  SerialPrintStrLn("[scrambleBytesAdv] Doing basic byte scrambling...");
  scrambleBytesBasic(bytes, size);

  /* Prepare salt */
  DUMP_STACK_STATS();
  SerialPrintStrLn("[scrambleBytesAdv] Reading salt...");
  spiffsRead("/salt", salt, SALT_SIZE);

  if (isAllZero(salt, SALT_SIZE)) {
    SerialPrintStrLn("[scrambleBytesAdv] Generating salt...");
    
    /* Generate new salt */
    hwrand_fill(salt, SALT_SIZE);

    /* Save it */
    SerialPrintStrLn("[scrambleBytesAdv] Saving salt...");
    spiffsWrite("/salt", salt, SALT_SIZE);
  }

  SerialPrintStrLn("[scrambleBytesAdv] Scrambling salt...");
  scrambleBytesBasic(salt, SALT_SIZE);

