TerpDAC/MicrophoneControllerCode/ESP8266_AS_ARDUINO_PROTOTYPE_FTEST/config.cpp
  SerialPrintStrLn("[scrambleBytesAdv] Fetching MAC address and saving it to the end of salt...");
  WiFi.macAddress(salt + SALT_SIZE);

  /* Mix MAC into salt */
  SerialPrintStrLn("[scrambleBytesAdv] Mixing MAC into salt...");
  for (i = 0; i < 6; i++) {
    tmp = salt[i * 2];
    salt[i * 2] = salt[SALT_SIZE + i];
    salt[SALT_SIZE + i] = tmp;
  }

  /* XOR with salt + MAC + invert */
  SerialPrintStrLn("[scrambleBytesAdv] XORing bytes with salt and inverting...");
  for (i = 0; i < size; i++) {
    bytes[i] ^= salt[i % (SALT_SIZE + 6)];
    bytes[i] = ~bytes[i];
  }

  SerialPrintStr("[scrambleBytesAdv] Post scramble, first 3 bytes: ");
  Serial.print(bytes[0], HEX);
  Serial.print(bytes[1], HEX);
  Serial.println(bytes[2], HEX);
}

/**
 * Write encrypted data to the EEPROM, stored with a checksum.
 * 
 * Given unencrypted data, write encrypted data to the EEPROM.
 * The function will generate a new salt, IV, and key to go with
 * the data being stored, and they will be saved alongside the
 * encrypted data. (Base key will be stored in SPIFFS, while the salt,
 * IV, and resulting tag will be stored in EEPROM next to the
 * encrypted data.) The final key is derived from mixing.
 * 
 * Note that this just provides some obscurity to the data being stored -
 * it will only protect your data from possible casual snoopers (e.g.
 * someone that dumps the firmware and does not know what to do with it).
 * Physical protection to the device is still MANDATORY - this does NOT
 * provide meaningful data security due to keys being stored on the
 * device.
 * 
 * Once encrypted, the data will be sent to eepromWrite(), where it will
 * compute the CRC32 of the given data, and write it as the first 4 bytes
 * after the given offset. Once done, the data will be written right after the
 * checksum.
 * 
 * This is the final storage format:
 * [CRC32] [64 byte salt] [16 byte tag] [12 byte IV]
 * [Encrypted data (decoded chunks of 16)]
 * 
 * Encryption occurs as such:
 *   salt <- Gen(1^INDV_SALT_SIZE)
 *   key <- Gen(1^RAW_KEY_SIZE)
 *   key = SCRAMBLE_ADV(key)
 *   pre_aes_key <- key || salt
 *   aes_key <- sha256(pre_aes_key)
 *   iv <- Gen(1^IV_SIZE)
 *   ciphertext, tag <- AES-GCM(aes_key, iv, plaintext)
 * 
 * @param [in] offset  offset of the EEPROM to write to
 * @param [in] data    unencrypted data to write to the EEPROM encrypted
 * @param [in] size    size of the data that will be written to the EEPROM;
 *                     does NOT include the CRC32 or encrypted data appended
 * @see eepromCryptRead()
 * @see eepromWrite()
 */
void eepromCryptWrite(const int offset, const void *data, size_t size) {
  uint8_t indv_salt[INDV_SALT_SIZE];
  unsigned char raw_key[RAW_KEY_SIZE + INDV_SALT_SIZE];
  unsigned char sha256_hash[32];
  unsigned char iv[12];
  unsigned char tag[16];

  unsigned char enc_data[size];
  unsigned char eeprom_data[INDV_SALT_SIZE + 16 + 12 + size];

  int result;
  
  mbedtls_gcm_context gcm;

  /* Generate salt for raw key */
  SerialPrintStrLn("[eepromCryptWrite] Generating salt for raw key...");
  hwrand_fill(indv_salt, INDV_SALT_SIZE);

  /* Build key to use for AES hash */
  SerialPrintStrLn("[eepromCryptWrite] Building AES key, part 1 (raw key)...");

  /* Generate a new raw key */
  SerialPrintStrLn("[eepromCryptWrite]  * Generating random raw key...");
  hwrand_fill(raw_key, RAW_KEY_SIZE);

  /* Write the raw key to SPIFFS */
  String key_fn = "/key_" + String(offset);
  SerialPrintStrLn("[eepromCryptWrite]  * Saving raw key to SPIFFS...");
  spiffsWrite(key_fn.c_str(), raw_key, RAW_KEY_SIZE);
  
  /* 
   * Scramble and harass to make a new little key (and disguise the one that
   * people may see in code)
   */
  SerialPrintStrLn("[eepromCryptWrite]  * Scrambling raw key to derive new key...");
  scrambleBytesAdv(raw_key, RAW_KEY_SIZE);

  /* Add our individual salt */
  SerialPrintStrLn("[eepromCryptWrite]  * Appending individual salt to new key...");
  memcpy(raw_key + RAW_KEY_SIZE, indv_salt, INDV_SALT_SIZE);
  
  SerialPrintStrLn("[eepromCryptWrite] Building AES key, part 2 (sha256)...");
  mbedtls_sha256((const unsigned char *)raw_key, RAW_KEY_SIZE + INDV_SALT_SIZE, sha256_hash, 0);
  Serial.println(sha256_hash[0], HEX);
  Serial.println(sha256_hash[1], HEX);
  Serial.println(sha256_hash[2], HEX);

  /* Generate IV */
  SerialPrintStrLn("[eepromCryptWrite] Generating IV for AES...");
  hwrand_fill(iv, 12);
  
  /* GCM */
  SerialPrintStrLn("[eepromCryptWrite] Encrypting and signing with AES GCM...");
  mbedtls_gcm_init(&gcm);
  mbedtls_gcm_setkey(&gcm, MBEDTLS_CIPHER_ID_AES, sha256_hash, 256);
  result = mbedtls_gcm_crypt_and_tag(&gcm, MBEDTLS_GCM_ENCRYPT, size, iv, 12, NULL, 0, (const unsigned char *) data, (unsigned char *) enc_data, 16, tag);
  mbedtls_gcm_free(&gcm);

  if (result != 0) {
    SerialPrintStrLn("[eepromCryptWrite] Could not encrypt data!");
    SerialPrintStr("[eepromCryptWrite] Error code (hex): ");
    Serial.println(result, HEX);
    return;
  }

  SerialPrintStrLn("Tag hex data (first/last 3 bytes):");
  Serial.println(tag[0], HEX);
  Serial.println(tag[1], HEX);
  Serial.println(tag[2], HEX);
  Serial.println(tag[13], HEX);
  Serial.println(tag[14], HEX);
  Serial.println(tag[15], HEX);

  /* Save everything! */
  SerialPrintStrLn("[eepromCryptWrite] Building final encrypted data...");
  memcpy(eeprom_data, indv_salt, INDV_SALT_SIZE);
  memcpy(eeprom_data+INDV_SALT_SIZE, tag, 16);
  memcpy(eeprom_data+INDV_SALT_SIZE+16, iv, 12);
  memcpy(eeprom_data+INDV_SALT_SIZE+16+12, enc_data, size);

  SerialPrintStrLn("[eepromCryptWrite] Writing final encrypted data to EEPROM...");
  eepromWrite(offset, eeprom_data, size+INDV_SALT_SIZE+16+12);
}

/**
 * Read and verify encrypted data from the EEPROM.
 * 
 * Read encrypted data from the EEPROM, and decrypt the data if at all possible.
 * This function will read the entire data chunk specified (including the CRC32,
 * and encryption paramaters). Once read, the data will be verified with
 * the first 4 bytes of the data chunk, aka the CRC32 checksum computed when
 * the data was written. If the checksum fails, the data pointer will be zeroed
 * out. This is all done within eepromRead().
 * 
 * If the data is verified, the encryption parameters are then extracted - the
 * salt, IV, and tag are separated. From there, the key for this particular data
 * chunk is also fetched, and it is mixed to produce the final key. The data will
 * them be verified with the tag and key. If the data is authenticated, the data
 * will be written to the pointer provided. However, if authentication fails, or
 * there is an issue with decrypting the data, the pointer will instead be written
 * with zeroes.
 * 
 * Note that this just provides some obscurity to the data being stored -
 * it will only protect your data from possible casual snoopers (e.g.
 * someone that dumps the firmware and does not know what to do with it).
 * Physical protection to the device is still MANDATORY - this does NOT
 * provide meaningful data security due to keys being stored on the
 * device.
 * 
 * Decryption occurs as such:
 *   salt <- (retrieve)
 *   key <- (retrieve)
 *   key = SCRAMBLE_ADV(key)
 *   pre_aes_key <- key || salt
 *   aes_key <- sha256(pre_aes_key)
 *   iv <- (retrieve)
 *   plaintext, vrfy <- AES-GCM-DEC(aes_key, iv, ciphertext)
 *   if (vrfy) return plaintext; else return none
 * 
 * @param [in]  offset  offset of the EEPROM to read from
 * @param [out] data    data to read out from the EEPROM; should contain enough
 *                      memory to store the amount of data specified in the size
 *                      argument
 * @param [in]  size    size of the data that will be read from the EEPROM;
 *                      does NOT include the CRC32
 * @see eepromCryptWrite()
 * @see eepromRead()
 */
void eepromCryptRead(const int offset, void *data, size_t size) {
  uint8_t indv_salt[INDV_SALT_SIZE];
  unsigned char raw_key[RAW_KEY_SIZE + INDV_SALT_SIZE];
  unsigned char sha256_hash[32];
  unsigned char iv[12];
  unsigned char tag[16];
  int result;

  unsigned char enc_data[INDV_SALT_SIZE + 16 + 12 + size];

  /* Read from EEPROM */
  SerialPrintStrLn("[eepromCryptRead] Reading encrypted data from EEPROM...");
  eepromRead(offset, enc_data, size+INDV_SALT_SIZE+16+12);

