TerpDAC/MicrophoneControllerCode/ESP8266_AS_ARDUINO_PROTOTYPE_FTEST/config.cpp
  /* Make sure we didn't get back a zeroed-out response */
  if (isAllZero(enc_data, size+INDV_SALT_SIZE+16+12)) {
    /* Zero out memory */
    SerialPrintStrLn("[eepromCryptRead] CRC32 failed when reading from EEPROM, returning.");
    SerialPrintStrLn("(memset to zero)");
    Serial.println(size);
    if (size > 1)
      memset(data, 0, size);
    SerialPrintStrLn("(return)");
    return;
  }
  
  /* Read everything! */
  SerialPrintStrLn("[eepromCryptRead] Extracting encrypted data...");
  memcpy(indv_salt, enc_data, INDV_SALT_SIZE);
  memcpy(tag, enc_data+INDV_SALT_SIZE, 16);
  memcpy(iv, enc_data+INDV_SALT_SIZE+16, 12);
  memcpy(enc_data, enc_data+INDV_SALT_SIZE+16+12, size);
  /* 
   * model:
   * copy 5 bytes from pos 12 to pos 0, so 0-4
   * set idx 5 from pos 5-11 to zero
   * memset(enc_data + 5, 0, 12 - 5); 
   */
  memset(enc_data+size, 0, (INDV_SALT_SIZE+16+12) - size);

  SerialPrintStrLn("Tag hex data (first/last 3 bytes):");
  Serial.println(tag[0], HEX);
  Serial.println(tag[1], HEX);
  Serial.println(tag[2], HEX);
  Serial.println(tag[13], HEX);
  Serial.println(tag[14], HEX);
  Serial.println(tag[15], HEX);

  mbedtls_gcm_context gcm;

  /* Build key to use for AES hash */
  SerialPrintStrLn("[eepromCryptRead] Building AES key, part 1 (raw key)...");

  /* Read the raw key from SPIFFS */
  String key_fn = "/key_" + String(offset);
  if (!SPIFFS.exists(key_fn.c_str())) {
    SerialPrintStrLn("[eepromCryptRead] Raw key file not found in SPIFFS, stopping.");
    if (size > 1)
      memset(data, 0, size);
    return;
  }

  SerialPrintStrLn("[eepromCryptRead]  * Reading raw key from SPIFFS...");
  spiffsRead(key_fn.c_str(), raw_key, RAW_KEY_SIZE);

  if (isAllZero(raw_key, RAW_KEY_SIZE)) {
    SerialPrintStrLn("[eepromCryptRead] Read a very strange all-zero raw key file from SPIFFS, deleting and stopping.");
    SPIFFS.remove(key_fn.c_str());
    if (size > 1)
      memset(data, 0, size);
    return;
  }
  
  /* 
   * Scramble and harass to make a new little key (and disguise the one that
   * people may see in code)
   */
  SerialPrintStrLn("[eepromCryptRead]  * Scrambling raw key to derive new key...");
  scrambleBytesAdv(raw_key, RAW_KEY_SIZE);

  /* Add our individual salt */
  SerialPrintStrLn("[eepromCryptRead]  * Appending individual salt to new key...");
  memcpy(raw_key + RAW_KEY_SIZE, indv_salt, INDV_SALT_SIZE);
  
  SerialPrintStrLn("[eepromCryptRead] Building AES key, part 2 (sha256)...");
  mbedtls_sha256((const unsigned char *)raw_key, RAW_KEY_SIZE + INDV_SALT_SIZE, sha256_hash, 0);
  Serial.println(sha256_hash[0], HEX);
  Serial.println(sha256_hash[1], HEX);
  Serial.println(sha256_hash[2], HEX);
  
  /* GCM */
  SerialPrintStrLn("[eepromCryptRead] Validating and decrypting with AES GCM...");
  mbedtls_gcm_init(&gcm);
  mbedtls_gcm_setkey(&gcm, MBEDTLS_CIPHER_ID_AES, sha256_hash, 256);
  result = mbedtls_gcm_auth_decrypt(&gcm, size, iv, 12, NULL, 0, tag, 16, (const unsigned char *) enc_data, (unsigned char *) data);
  mbedtls_gcm_free(&gcm);

  if (result != 0) {
    /* Zero out memory */
    SerialPrintStrLn("[eepromCryptRead] Could not decrypt data!");
    SerialPrintStr("[eepromCryptRead] Error code (hex): ");
    Serial.println(result, HEX);

    if (result == MBEDTLS_ERR_GCM_AUTH_FAILED) SerialPrintStrLn("[eepromCryptRead] Decoded error: MBEDTLS_ERR_GCM_AUTH_FAILED");
    if (result == MBEDTLS_ERR_GCM_BAD_INPUT) SerialPrintStrLn("[eepromCryptRead] Decoded error: MBEDTLS_ERR_GCM_BAD_INPUT");

    if (size > 1)
      memset(data, 0, size);
  }
}

/**
 * Load thresholds stored in EEPROM.
 * 
 * Attempt to load thresholds stored in EEPROM. If the thresholds stored are
 * invalid, this function will not update anything.
 * 
 * @see saveLocalThresholds()
 */
void loadLocalThresholds() {
  int mid_thresh_tmp = 0;
  int high_thresh_tmp = 0;
  
  eepromRead(EEPROM_MID_THRESH_OFFSET, &mid_thresh_tmp, SUB_CRC(EEPROM_MID_THRESH_SIZE));
  eepromRead(EEPROM_HIGH_THRESH_OFFSET, &high_thresh_tmp, SUB_CRC(EEPROM_HIGH_THRESH_SIZE));
  
  if ((mid_thresh_tmp > 0) && (mid_thresh_tmp < 1024)) {
    mid_thresh = mid_thresh_tmp;
    SerialPrintStrLn("[loadLocalThresholds] Loaded saved mid thresh!");
  } else {
    SerialPrintStr("[loadLocalThresholds] Not loading invalid saved mid thresh: ");
    Serial.println(mid_thresh_tmp);
  }

  if ((high_thresh_tmp > 0) && (high_thresh_tmp < 1024)) {
    high_thresh = high_thresh_tmp;
    SerialPrintStrLn("[loadLocalThresholds] Loaded saved high thresh!");
  } else {
    SerialPrintStr("[loadLocalThresholds] Not loading invalid saved high thresh: ");
    Serial.println(high_thresh_tmp);
  }

  SerialPrintStr("[loadLocalThresholds] Current mid thresh: ");
  Serial.println(mid_thresh);
  SerialPrintStr("[loadLocalThresholds] Current high thresh: ");
  Serial.println(high_thresh);
}

/**
 * Save thresholds from memory into EEPROM.
 * 
 * Attempt to save thresholds from memory into EEPROM. This function will
 * overwrite any existing thresholds stored.
 * 
 * @see loadLocalThresholds()
 */
void saveLocalThresholds() {
  SerialPrintStrLn("[saveLocalThresholds] Saving thresholds!");

  SerialPrintStrLn("[saveLocalThresholds]   Saving mid thresh...");
  eepromWrite(EEPROM_MID_THRESH_OFFSET, &mid_thresh, EEPROM_MID_THRESH_SIZE - EEPROM_DATA_CHUNK_CRC_SIZE);
  
  SerialPrintStrLn("[saveLocalThresholds]   Saving high thresh...");
  eepromWrite(EEPROM_HIGH_THRESH_OFFSET, &high_thresh, EEPROM_HIGH_THRESH_SIZE - EEPROM_DATA_CHUNK_CRC_SIZE);

  // Commit changes!
  EEPROM.commit();
}

/**
 * Load WiFi credentials stored in EEPROM.
 * 
 * Attempt to load WiFi credentials stored in EEPROM. If the WiFi credentials
 * stored are invalid, this function will not update anything.
 * 
 * This configuration field is encrypted.
 * 
 * @see saveLocalWiFiCredentials()
 */
void loadLocalWiFiCredentials() {
  char ssid_tmp[33];
  char psk_tmp[65];

  /*
  SerialPrintStrLn("SUB_ENC(SUB_CRC(EEPROM_WIFI_SSID_SIZE))");
  Serial.println(SUB_ENC(SUB_CRC(EEPROM_WIFI_SSID_SIZE)));
  */
  eepromCryptRead(EEPROM_WIFI_SSID_OFFSET, ssid_tmp, SUB_ENC(SUB_CRC(EEPROM_WIFI_SSID_SIZE)));

