TerpDAC/MicrophoneControllerCode/ESP8266_AS_ARDUINO_PROTOTYPE_FTEST/config.cpp
  /*
  SerialPrintStrLn("SUB_ENC(SUB_CRC(EEPROM_WIFI_PSK_SIZE))");
  Serial.println(SUB_ENC(SUB_CRC(EEPROM_WIFI_PSK_SIZE)));
  */
  eepromCryptRead(EEPROM_WIFI_PSK_OFFSET, psk_tmp, SUB_ENC(SUB_CRC(EEPROM_WIFI_PSK_SIZE)));

  SerialPrintStr("ssid_tmp = ");
  Serial.println(ssid_tmp);

  SerialPrintStr("psk_tmp = ");
  Serial.println(psk_tmp);

  if (strlen(ssid_tmp) <= 0) {
    SerialPrintStrLn("[loadLocalWiFiCredentials] Found empty SSID, not loading.");
  } else {
    strcpy(ssid, ssid_tmp);
  }

  if (strlen(psk_tmp) <= 0) {
    SerialPrintStrLn("[loadLocalWiFiCredentials] Found empty PSK, not loading.");
  } else {
    strcpy(password, psk_tmp);
  }
}

/**
 * Save WiFi credentials into EEPROM.
 * 
 * Attempt to save WiFi credentials provided into EEPROM. This function will
 * overwrite any existing credentials stored.
 * 
 * This configuration field is encrypted.
 * 
 * @param [in]  ssid    WiFi SSID to save
 * @param [in]  psk     WiFi PSK to save
 * @see loadLocalWiFiCredentials()
 */
void saveLocalWiFiCredentials(const char ssid[33], const char psk[65]) {
  SerialPrintStrLn("[saveLocalWiFiCredentials] Saving WiFi credentials!");

  SerialPrintStrLn("[saveLocalWiFiCredentials]   Saving WiFi SSID...");
  eepromCryptWrite(EEPROM_WIFI_SSID_OFFSET, (void *) ssid, SUB_ENC(SUB_CRC(EEPROM_WIFI_SSID_SIZE)));
  
  SerialPrintStrLn("[saveLocalWiFiCredentials]   Saving WiFi PSK...");
  eepromCryptWrite(EEPROM_WIFI_PSK_OFFSET, psk, SUB_ENC(SUB_CRC(EEPROM_WIFI_PSK_SIZE)));

  // Commit changes!
  EEPROM.commit();

  SerialPrintStrLn("[saveLocalWiFiCredentials] All saved!");
}

/**
 * Load server configuration stored in EEPROM.
 * 
 * Attempt to load server configuration stored in EEPROM. If the configuration
 * stored is invalid, this function will not update anything.
 * 
 * This configuration field is encrypted, except for HTTPS usage.
 * 
 * @see saveLocalWiFiCredentials()
 */
void loadLocalServerCredentials() {
  char micsense_server_tmp[65];
  char https_fingerprint_tmp[129];
  
  /*
  SerialPrintStrLn("SUB_ENC(SUB_CRC(EEPROM_WIFI_SSID_SIZE))");
  Serial.println(SUB_ENC(SUB_CRC(EEPROM_WIFI_SSID_SIZE)));
  */
  eepromCryptRead(EEPROM_MICSENSE_SERVER_OFFSET, micsense_server_tmp, SUB_ENC(SUB_CRC(EEPROM_MICSENSE_SERVER_SIZE)));
  micsense_server_tmp[64] = '\0';

  eepromRead(EEPROM_USE_HTTPS_OFFSET, &https_enabled, SUB_CRC(EEPROM_USE_HTTPS_SIZE));
  
  /*
  SerialPrintStrLn("SUB_ENC(SUB_CRC(EEPROM_WIFI_PSK_SIZE))");
  Serial.println(SUB_ENC(SUB_CRC(EEPROM_WIFI_PSK_SIZE)));
  */
  eepromCryptRead(EEPROM_HTTPS_FINGERPRINT_OFFSET, https_fingerprint_tmp, SUB_ENC(SUB_CRC(EEPROM_HTTPS_FINGERPRINT_SIZE)));
  https_fingerprint_tmp[128] = '\0';

  SerialPrintStr("micsense_server_tmp = ");
  Serial.println(micsense_server_tmp);

  SerialPrintStr("https_enabled = ");
  Serial.println(https_enabled);
  
  SerialPrintStr("https_fingerprint_tmp = ");
  Serial.println(https_fingerprint_tmp);

  if (strlen(micsense_server_tmp) <= 0) {
    SerialPrintStrLn("[loadLocalServerCredentials] Found empty server, not loading.");
  } else {
    strcpy(micsense_server, micsense_server_tmp);
  }

  if (strlen(https_fingerprint_tmp) <= 0) {
    SerialPrintStrLn("[loadLocalServerCredentials] Found empty server HTTPS fingerprint, not loading.");
  } else {
    strcpy(https_fingerprint, https_fingerprint_tmp);
  }
}

/**
 * Save server configuration into EEPROM.
 * 
 * Attempt to save server configuration provided into EEPROM. This function will
 * overwrite any existing configuration stored.
 * 
 * This configuration field is encrypted.
 * 
 * @param [in]  ssid    WiFi SSID to save
 * @param [in]  psk     WiFi PSK to save
 * @see loadLocalWiFiCredentials()
 */
void saveLocalServerCredentials(const char micsense_server[65], const char use_https, const char https_fingerprint[129]) {
  SerialPrintStrLn("[saveLocalServerCredentials] Saving server configuration!");

  SerialPrintStrLn("[saveLocalServerCredentials]   Saving MicSense server...");
  eepromCryptWrite(EEPROM_MICSENSE_SERVER_OFFSET, (void *) micsense_server, SUB_ENC(SUB_CRC(EEPROM_MICSENSE_SERVER_SIZE)));

  SerialPrintStrLn("[saveLocalServerCredentials]   Saving HTTPS usage flag...");
  eepromWrite(EEPROM_USE_HTTPS_OFFSET, &use_https, SUB_CRC(EEPROM_USE_HTTPS_SIZE));
  
  SerialPrintStrLn("[saveLocalServerCredentials]   Saving HTTPS fingerprint...");
  eepromCryptWrite(EEPROM_HTTPS_FINGERPRINT_OFFSET, https_fingerprint, SUB_ENC(SUB_CRC(EEPROM_HTTPS_FINGERPRINT_SIZE)));

  // Commit changes!
  EEPROM.commit();

  SerialPrintStrLn("[saveLocalServerCredentials] All saved!");
}


void loadAllConfiguration() {
  /* WiFi Credentials */
#if defined(PRELOAD_SSID_PSK) || defined(PRELOAD_ALL_CONFIG)
  SerialPrintStrLn("[loadAllConfiguration] Will preload WiFi configuration!");
  SerialPrintStr("[loadAllConfiguration] SSID: ");
  SerialPrintStrLn(PRELOAD_SSID);
  SerialPrintStr("[loadAllConfiguration] PSK:  ");
  SerialPrintStrLn(PRELOAD_PASS);
  saveLocalWiFiCredentials(PRELOAD_SSID, PRELOAD_PASS);
#ifndef PRELOAD_ALL_CONFIG
  PRINT_FOREVER("[loadAllConfiguration] WiFi configuration preloading complete. Please comment out PRELOAD_SSID_PSK in WiFiConfig.h and resend.");
#else
  SerialPrintStrLn("[loadAllConfiguration] WiFi configuration preloading complete.");
#endif
#endif
  SerialPrintStrLn("[loadAllConfiguration] Loading WiFi configuration...");
  loadLocalWiFiCredentials();

  /* MicSense Server Credentials */
#if defined(PRELOAD_SERVER_CONFIG) || defined(PRELOAD_ALL_CONFIG)
  SerialPrintStrLn("[loadAllConfiguration] Will preload server configuration!");
  SerialPrintStr("[loadAllConfiguration] Server:             ");
  SerialPrintStrLn(PRELOAD_MICSENSE_SERVER);
  SerialPrintStr("[loadAllConfiguration] HTTPS:              ");
  Serial.println(PRELOAD_USE_HTTPS);
  SerialPrintStr("[loadAllConfiguration] HTTPS Fingerprint:  ");
  SerialPrintStrLn(PRELOAD_HTTPS_FINGERPRINT);
  saveLocalServerCredentials(PRELOAD_MICSENSE_SERVER, PRELOAD_USE_HTTPS, PRELOAD_HTTPS_FINGERPRINT);
#ifndef PRELOAD_ALL_CONFIG
  PRINT_FOREVER("[loadAllConfiguration] Server configuration preloading complete. Please comment out PRELOAD_SERVER_CONFIG in MicSenseComm.h and resend.");
#else
  SerialPrintStrLn("[loadAllConfiguration] Server configuration preloading complete.");
#endif
#endif
  SerialPrintStrLn("[loadAllConfiguration] Loading server configuration...");
  loadLocalServerCredentials();

#ifdef PRELOAD_ALL_CONFIG
  PRINT_FOREVER("[loadAllConfiguration] All configuration has been preloaded. Please comment out PRELOAD_ALL_CONFIG in WiFiConfig.h and resend.");
#endif
}

